codeIgniter/ci4basedatos/app/Models/CategoryModel.php

    public function getCategories()
    {
        return $this->findAll();
---
SELECT *
FROM `category`