codeIgniter/ci4basedatos/app/Models/NewsModel.php

SELECT `news`.*, `category`.`category`
FROM `news`
JOIN `category` ON `news`.`id_category`=`category`.`id`
---
    public function getNews($slug = false)
    {
        if ($slug === false) {
            $sql = $this->select('news.*, category.category');
            $sql = $this->join('category','news.id_category=category.id');
            $sql = $this->findAll();