codeIgniter/codeigniter1/app/Models/NewsModel.php

    public function getNews($slug = false)
    {
        // al poner slug false es un método opcional
        // Si no hay slug, mostrará toda la tabla
        if ($slug === false) {
            return $this->findAll();
---
SELECT *
FROM `news`

    public function getById($id){
        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `news`
WHERE `id` = '1'
 LIMIT 1