codeIgniter/codeigniter/app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function new(){
        helper("form");

        $model = model(ProductsModel::class);
        if ($data['products'] = $model->findAll()) {

INSERT INTO `products` (`name`, `brand`, `description`) VALUES ('Ordenador de trinki', 'APPLE', 'Trabaja solo y puedes irte de vacaciones')
---
    public function create()
    {
        helper('form');

        if (! $this->validate([
            'name' => 'required|max_length[255]|min_length[3]',
            'brand' => 'required|max_length[255]|min_length[3]',
            'description'  => 'required|max_length[255]|min_length[3]',
        ])) {
            return $this->new();
        }

        $post = $this->request->getPost();

        $model = model(ProductsModel::class);


        $model->save([
            'name' => $post['name'],
            'brand' => $post['brand'],
            'description' => $post['description'],
        ]);