codeIgniter/codeigniter1/app/Controllers/News.php

    public function update($id){
        helper('form');

        if ($id == null) {
            throw new PageNotFoundException('Cannot update the item.');
        }

        $model = model(NewsModel::class);

        if ($model->where('id',$id)->find()) {
---
SELECT *
FROM `news`
WHERE `id` = '1'

    public function updatedItem($id)
    {
        helper('form');

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validate([
            'title' => 'required|max_length[255]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[10]',
        ])) {
            // The validation fails, so returns the form.
            return $this->update($id);
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $data = [
            'id' => $id,
            'title' => $post['title'],
            'slug'  => url_title($post['title'], '-', true),
            'body'  => $post['body'],
        ];
        $model = model(NewsModel::class);
        $model->save($data);
---
UPDATE `news` SET `title` = 'Elvis sighted', `slug` = 'elvis-sighted', `body` = '  Elvis was sighted at the Podunk internet cafe. It looked like he was writing a CodeIgniter app.\r\n\r\nElvis fue avistado en el café internet de Podunk. Parecía estar escribiendo una aplicación CodeIgniter'
WHERE `news`.`id` IN ('1')