codeIgniter/codeigniter/app/Models/ProductsModel.php

SELECT *
FROM `products`
---
    public function getProducts()
    {
        return $this->findAll();

SELECT *
FROM `products`
WHERE `id_product` = '6'
 LIMIT 1
---
    public function getProductById($id_product){
        return $this->where(['id_product' => $id_product])->first();